In [46]:
import pandas as pd

### Adding columns

In [8]:
data = {
    "Name": ["Ram", "Shyam", "Ghanshyam", "Aditi", "Jagdish", "Raj", "Simran"],
    "Age": [23,45,32,45,67,89,21],
    "Salary": [656565,787887,899898,344334,766767,545454,900909],
    "Performance_Score": [76,45,32,86,53,46,87]
}

df = pd.DataFrame(data)
print(df)


## adding column using square bracket 
df["Bonus"] = df["Salary"] * 0.1
print(df)


## adding data using insert method 
## df.insert(location, "Column_Name", data_for_Columns)
df.insert(0, "Employee_id", [10,20,30,40,50,60,70])
print(df)

        Name  Age  Salary  Performance_Score
0        Ram   23  656565                 76
1      Shyam   45  787887                 45
2  Ghanshyam   32  899898                 32
3      Aditi   45  344334                 86
4    Jagdish   67  766767                 53
5        Raj   89  545454                 46
6     Simran   21  900909                 87
        Name  Age  Salary  Performance_Score    Bonus
0        Ram   23  656565                 76  65656.5
1      Shyam   45  787887                 45  78788.7
2  Ghanshyam   32  899898                 32  89989.8
3      Aditi   45  344334                 86  34433.4
4    Jagdish   67  766767                 53  76676.7
5        Raj   89  545454                 46  54545.4
6     Simran   21  900909                 87  90090.9
   Employee_id       Name  Age  Salary  Performance_Score    Bonus
0           10        Ram   23  656565                 76  65656.5
1           20      Shyam   45  787887                 45  78788.7
2           30  Ghanshyam   32  899898                 32  89989.8
3           40      Aditi   45  344334                 86  34433.4
4           50    Jagdish   67  766767                 53  76676.7
5           60        Raj   89  545454                 46  54545.4
6           70     Simran   21  900909                 87  90090.9

### Updating values

In [ ]:
## updating the data of a specific cell 

## Syntax -- df.loc[row_index, "Column_Name"] = new_value

data = {
    "Name": ["Ram", "Shyam", "Ghanshyam", "Aditi", "Jagdish", "Raj", "Simran"],
    "Age": [23,45,32,45,67,89,21],
    "Salary": [656565,787887,899898,344334,766767,545454,900909],
    "Performance_Score": [76,45,32,86,53,46,87]
}

df = pd.DataFrame(data)
print(df)

## updating the salary of Ram
df.loc[0, "Salary"] = 1000000
print(df)

## updating the salary of all the employee
## in this case .. we should remember that we are updating this means we have to make change which will result in the final value
df["Salary"] = df["Salary"] * 1.05
print(df)

        Name  Age  Salary  Performance_Score
0        Ram   23  656565                 76
1      Shyam   45  787887                 45
2  Ghanshyam   32  899898                 32
3      Aditi   45  344334                 86
4    Jagdish   67  766767                 53
5        Raj   89  545454                 46
6     Simran   21  900909                 87
        Name  Age   Salary  Performance_Score
0        Ram   23  1000000                 76
1      Shyam   45   787887                 45
2  Ghanshyam   32   899898                 32
3      Aditi   45   344334                 86
4    Jagdish   67   766767                 53
5        Raj   89   545454                 46
6     Simran   21   900909                 87
        Name  Age      Salary  Performance_Score
0        Ram   23  1050000.00                 76
1      Shyam   45   827281.35                 45
2  Ghanshyam   32   944892.90                 32
3      Aditi   45   361550.70                 86
4    Jagdish   67   805105.35                 53
5        Raj   89   572726.70                 46
6     Simran   21   945954.45                 87

### Deleting columns

In [15]:
data = {
    "Name": ["Ram", "Shyam", "Ghanshyam", "Aditi", "Jagdish", "Raj", "Simran"],
    "Age": [23,45,32,45,67,89,21],
    "Salary": [656565,787887,899898,344334,766767,545454,900909],
    "Performance_Score": [76,45,32,86,53,46,87]
}

df = pd.DataFrame(data)
print(df)


## for deleting single column
df.drop(columns=["Age"], inplace=True)
print(df)

## for deleting multiple columns
df.drop(columns=["Performance_Score", "Salary"], inplace=True)
print(df)

        Name  Age  Salary  Performance_Score
0        Ram   23  656565                 76
1      Shyam   45  787887                 45
2  Ghanshyam   32  899898                 32
3      Aditi   45  344334                 86
4    Jagdish   67  766767                 53
5        Raj   89  545454                 46
6     Simran   21  900909                 87
        Name  Salary  Performance_Score
0        Ram  656565                 76
1      Shyam  787887                 45
2  Ghanshyam  899898                 32
3      Aditi  344334                 86
4    Jagdish  766767                 53
5        Raj  545454                 46
6     Simran  900909                 87
        Name
0        Ram
1      Shyam
2  Ghanshyam
3      Aditi
4    Jagdish
5        Raj
6     Simran

### Handling Missing Data

In [ ]:
# NaN (Not a Number)
# None (for object data types)

### isnull() method

In [4]:
# return boolean value 
# if the value is missing then it will return true
# if the value is present then it will return false 


data = {
    "Name": ["Ram", None, "Ghanshyam", "Aditi", "Jagdish", "Raj", "Simran"],
    "Age": [23,None,32,45,67,89,21],
    "Salary": [656565,None,899898,344334,766767,545454,900909],
    "Performance_Score": [76,None,32,86,53,46,87]
}

df = pd.DataFrame(data)
print(df)

print(df.isnull())


## isnull().sum() -- this method is used for returning the number of missing value in each column
print(df.isnull().sum())

        Name   Age    Salary  Performance_Score
0        Ram  23.0  656565.0               76.0
1       None   NaN       NaN                NaN
2  Ghanshyam  32.0  899898.0               32.0
3      Aditi  45.0  344334.0               86.0
4    Jagdish  67.0  766767.0               53.0
5        Raj  89.0  545454.0               46.0
6     Simran  21.0  900909.0               87.0
    Name    Age  Salary  Performance_Score
0  False  False   False              False
1   True   True    True               True
2  False  False   False              False
3  False  False   False              False
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
Name                 1
Age                  1
Salary               1
Performance_Score    1
dtype: int64

### dropna() method

In [13]:
# when we want to delete the none values columns or rows then we use this method 

data = {
    "Name": ["Ram", None, "Ghanshyam", "Aditi", "Jagdish", "Raj", "Simran"],
    "Age": [23,None,32,45,67,89,21],
    "Salary": [656565,None,899898,344334,766767,545454,900909],
    "Performance_Score": [76,None,87,86,53,46,87]
}

df = pd.DataFrame(data)
print(df)

print(df.isnull())

# axis = 0 -- means removing rows
# this will remove each row which contain any None value 

# axis = 1 -- means removing columns
# this will remove each column which contain any None value

df.dropna(axis=0, inplace=True)
print(df)

        Name   Age    Salary  Performance_Score
0        Ram  23.0  656565.0               76.0
1       None   NaN       NaN                NaN
2  Ghanshyam  32.0  899898.0               87.0
3      Aditi  45.0  344334.0               86.0
4    Jagdish  67.0  766767.0               53.0
5        Raj  89.0  545454.0               46.0
6     Simran  21.0  900909.0               87.0
    Name    Age  Salary  Performance_Score
0  False  False   False              False
1   True   True    True               True
2  False  False   False              False
3  False  False   False              False
4  False  False   False              False
5  False  False   False              False
6  False  False   False              False
        Name   Age    Salary  Performance_Score
0        Ram  23.0  656565.0               76.0
2  Ghanshyam  32.0  899898.0               87.0
3      Aditi  45.0  344334.0               86.0
4    Jagdish  67.0  766767.0               53.0
5        Raj  89.0  545454.0               46.0
6     Simran  21.0  900909.0               87.0

### fillna() method

In [21]:
# this method is used for filling the value in the place of None values


data = {
    "Name": ["Ram", None, "Ghanshyam", "Aditi", "Jagdish", "Raj", "Simran"],
    "Age": [23,None,32,45,67,89,21],
    "Salary": [656565,None,899898,344334,766767,545454,900909],
    "Performance_Score": [76,None,32,86,53,46,87]
}

df = pd.DataFrame(data)
print(df)

# print(df.isnull())

# this will fill 0 to each None value place
# df.fillna(0, inplace=True)
# print(df)


# now suppose we only want to fill the value in the Age columns 
# then first we access it

# df['Age'].fillna(43, inplace=True) -- both are same 
# df.fillna({'Age': 43}, inplace=True) -- both are same

# print(df)

# we can also give the value by using any equation also 
# like -- this will fill the mean value in it
df.fillna( {'Age': df['Age'].mean()} , inplace=True)
print(df)

df.fillna( {"Salary": 78877878}, inplace=True)
print(df)

        Name   Age    Salary  Performance_Score
0        Ram  23.0  656565.0               76.0
1       None   NaN       NaN                NaN
2  Ghanshyam  32.0  899898.0               32.0
3      Aditi  45.0  344334.0               86.0
4    Jagdish  67.0  766767.0               53.0
5        Raj  89.0  545454.0               46.0
6     Simran  21.0  900909.0               87.0
        Name        Age    Salary  Performance_Score
0        Ram  23.000000  656565.0               76.0
1       None  46.166667       NaN                NaN
2  Ghanshyam  32.000000  899898.0               32.0
3      Aditi  45.000000  344334.0               86.0
4    Jagdish  67.000000  766767.0               53.0
5        Raj  89.000000  545454.0               46.0
6     Simran  21.000000  900909.0               87.0
        Name        Age      Salary  Performance_Score
0        Ram  23.000000    656565.0               76.0
1       None  46.166667  78877878.0                NaN
2  Ghanshyam  32.000000    899898.0               32.0
3      Aditi  45.000000    344334.0               86.0
4    Jagdish  67.000000    766767.0               53.0
5        Raj  89.000000    545454.0               46.0
6     Simran  21.000000    900909.0               87.0

### Interpolation

In [29]:
# this is basically manipulation of the none values on the basis of other things 
# there are many kinds of interpolation -- linear, time, index, polynomial, spline and so on 
# we should not use this with data set such as Name, etc.


data = {
    "Name": ["Ram", None, "Ghanshyam", "Aditi", "Jagdish", "Raj", "Simran"],
    "Age": [23,None,32,45,67,89,21],
    "Salary": [656565,None,899898,344334,766767,545454,900909],
    "Performance_Score": [76,None,32,86,53,46,87]
}

df = pd.DataFrame(data)
print(df)

# here we want to fill the value of age using the interopolation 
# this will auto fill the data into the age cell by examining the other values in the age columns of other rows

# using index method -- giving value 27
# df['Age'] = df['Age'].interpolate(method="index")
# print(df)

# using linear method -- giving value 27 
df['Age'] = df['Age'].interpolate(method="linear")
print(df)

        Name   Age    Salary  Performance_Score
0        Ram  23.0  656565.0               76.0
1       None   NaN       NaN                NaN
2  Ghanshyam  32.0  899898.0               32.0
3      Aditi  45.0  344334.0               86.0
4    Jagdish  67.0  766767.0               53.0
5        Raj  89.0  545454.0               46.0
6     Simran  21.0  900909.0               87.0
        Name   Age    Salary  Performance_Score
0        Ram  23.0  656565.0               76.0
1       None  27.5       NaN                NaN
2  Ghanshyam  32.0  899898.0               32.0
3      Aditi  45.0  344334.0               86.0
4    Jagdish  67.0  766767.0               53.0
5        Raj  89.0  545454.0               46.0
6     Simran  21.0  900909.0               87.0

### Sorting and Aggregation

In [ ]:
## if we want to sort the dataFrame on the basis of single column 
## True -- ascending
## False -- descending
## syntax -- df.sort_values(by="Column Name", True/False, inplace=True)

data = {
    "Name": ["Rahul", "Reeta", "Malviya", "Aanshi"],
    "Age": [32,12,78,32],
    "Salary": [100000, 545454, 30000, 10020]
}

df = pd.DataFrame(data)

# now we will sort on the basis of the age
df.sort_values(by="Age", ascending=True, inplace=True)
print(df)



# now we want to sort the data on the basis of multiple columns 
df.sort_values(by=['Age', 'Salary'], ascending=[False, True], inplace=True)
print(df)


# agreggation is simply like using the methods like mean sum and many more .. not very tough

      Name  Age  Salary
1    Reeta   12  545454
0    Rahul   32  100000
3   Aanshi   32   10020
2  Malviya   78   30000
      Name  Age  Salary
2  Malviya   78   30000
3   Aanshi   32   10020
0    Rahul   32  100000
1    Reeta   12  545454

### Grouping

In [41]:

data = {
    "Name": ["Aditi", "Ghanshyam", "Aditi", "Jagdish", "Raj", "Simran"],
    "Age": [23,32,23,67,89,67],
    "Salary": [656565,899898,344334,766767,545454,900909],
    "Performance_Score": [76,32,86,53,46,87]
}

df = pd.DataFrame(data)
print(df)


## grouping the columns on the basis of one or more columns 
grouped = df.groupby('Age')
print(grouped)

## now we want to sum the salary of the same age people 
grouped = df.groupby("Age")['Salary'].sum()
print(grouped)


## with multiple columns
grouped = df.groupby(["Age", "Name"])["Salary"].sum()
print(grouped)

        Name  Age  Salary  Performance_Score
0      Aditi   23  656565                 76
1  Ghanshyam   32  899898                 32
2      Aditi   23  344334                 86
3    Jagdish   67  766767                 53
4        Raj   89  545454                 46
5     Simran   67  900909                 87
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021FBBBDE8D0>
Age
23    1000899
32     899898
67    1667676
89     545454
Name: Salary, dtype: int64
Age  Name
23   Aditi        1000899
32   Ghanshyam     899898
67   Jagdish       766767
     Simran        900909
89   Raj           545454
Name: Salary, dtype: int64

In [ ]:
## sum()
## mean()
## count()
## min()
## max()
## std()

### Merging and Joining

In [ ]:
## pd.merge(df1, df2, on="Column_name", how="type of join")

data1 = {
    "Customer_id": [1,2,3],
    "Name": ["Ramesh", "Suresh", "Kalpesh"],
}

df1 = pd.DataFrame(data1)

data2 = {
    "Customer_id": [1,2,4],
    "OrderAmount": [250,450,350]
}

df2 = pd.DataFrame(data2)

# inner join 
# combine only the common values in both the data frames 
df_merged = pd.merge(df1, df2, on="Customer_id", how="inner")
print("Inner Join: ", df_merged)

# outer join
# give all values and give NaN at place of not finding the value
df_merged = pd.merge(df1, df2, on="Customer_id", how="outer")
print("Outer join: ", df_merged)

# cross join 
# this will work like the n * m 
# means this will do the cartesian multiplication of each row pf first data frame with all the rows of the second data frame
df_merged = pd.merge(df1, df2, how="cross")
print("Cross join: ", df_merged)

Inner Join:     Customer_id    Name  OrderAmount
0            1  Ramesh          250
1            2  Suresh          450
Outer join:     Customer_id     Name  OrderAmount
0            1   Ramesh        250.0
1            2   Suresh        450.0
2            3  Kalpesh          NaN
3            4      NaN        350.0
Cross join:     Customer_id_x     Name  Customer_id_y  OrderAmount
0              1   Ramesh              1          250
1              1   Ramesh              2          450
2              1   Ramesh              4          350
3              2   Suresh              1          250
4              2   Suresh              2          450
5              2   Suresh              4          350
6              3  Kalpesh              1          250
7              3  Kalpesh              2          450
8              3  Kalpesh              4          350

### Concatination

In [ ]:
## can do the concatination in 2 form 
## row wise (vertically)
## column wise (horizontally)

## Syntax -- pd.concate([df1, df2], axis = 0 , ignore_index = True)


## combined vertically 
data1 = {
    "Customer_id": [1,2],
    "Name": ["Gopal", "Raju"]
}

df1 = pd.DataFrame(data1)

data2 = {
    "Customer_id": [3,4],
    "Name": ["Shyam", "Baburao"]
}

df2 = pd.DataFrame(data1)


## vertically concatination
df_vertical_concat = pd.concat([df1, df2], axis=0 , ignore_index=True)
print(df_vertical_concat)
#    Customer_id   Name
# 0            1  Gopal
# 1            2   Raju
# 2            1  Gopal
# 3            2   Raju

## horizontally concatination
df_horizontal_concat = pd.concat([df1, df2], axis=1 , ignore_index=True)
print(df_horizontal_concat)
#    0      1  2      3
# 0  1  Gopal  1  Gopal
# 1  2   Raju  2   Raju

   Customer_id   Name
0            1  Gopal
1            2   Raju
2            1  Gopal
3            2   Raju
   0      1  2      3
0  1  Gopal  1  Gopal
1  2   Raju  2   Raju